interface Question {
    question: string;
    options: string[];
    correctAnswer: string;
  }
  
const questions: Question[] = [
    {
      question: 'Տվյալների տիպ, որի արժեքը յուրաքնչյուր հաջորդ գրառմանն անցնելիս ավտոմատ կերպով ավելացվում է մեկով',
      options: ['Number', 'Currency', 'AutoNumber', 'String'],
      correctAnswer: 'AutoNumber',
    },
    {
      question: 'Համակարգչային ծրագրերի հիմնական խմբերից չէ՝',
      options: ['լիցենզավորված', 'պայմանականորեն անվճար', ' ազատ տարածվող', 'շարժական'],
      correctAnswer: 'շարժական',
    },
    {
      question: 'Որոնման համակարգերով ինֆորմացիա փնտրելու գործընթացն իրականացվում է ըստ թեմային կամ՝',
      options: ['ըստ բառի', 'ըստ թվի', 'ըստ բանալի-բառերի', 'ըստ բանալի թեմայի'],
      correctAnswer: 'ըստ բանալի-բառերի',
    },
    {
      question: 'Ձեր ինֆորմատիկայի դասագրքում ինֆորմացիայի ո՞ր տեսակը չի հանդիպում',
      options: ['տեքստային', 'գրաֆիկական', 'թվային', 'ձայնային'],
      correctAnswer: 'ձայնային',
    },
    {
      question: ' Կախված ինֆորմացիայի ընկալման ձևերից՝ տարբերակվում են ինֆորմացիայի հետևյալ տեսակները',
      options: [
        'արտադրական, տեխնիկական, կազմակերպչական, ամենօրյա',
        'տեսողական, հոտառական, շոշափելի, լսողական, համային',  
        'տնտեսական, կենսաբանական, բժշկական, հոգեբանական և այլն', 
        'թվային, գրաֆիկական, տեքստային, աղյուսակային և այլն'],
      correctAnswer: 'տեսողական, հոտառական, շոշափելի, լսողական, համային',
    },
  ];
  export default questions;